{
  "idioma": "Language",
  "expandir": "Click to view information",
  "nav": {
    "Quem Sou": "About Me",
    "Serviços": "Services",
    "Portifolio": "Portfolio",
    "Tecnologias": "Technologies",
    "Contato": "Contact"
  },
  "sobre": {
    "p1": "Do you have an amazing vision for your website, blog, online store, or project, but you need someone to make it happen? If the answer is yes, I'm here to turn your digital dreams into a tangible reality. 😊",
    "p2": "I'm a passionate Full Stack Web Developer who thrives on challenges and crafting extraordinary online experiences. My skills include mastering technologies like ReactJS, Typescript, NodeJS, HTML, CSS, and Javascript. I don't just understand these languages; I put them to brilliant use to create standout websites and applications. 💻✨",
    "p3": "But that's not all. Beyond my technical prowess, I'm fluent in English and French, which means I can work on multilingual projects and reach global audiences. 🌍🗣️",
    "p4": "Imagine having a website that not only visually impresses but also functions flawlessly on all devices. Think of an online store that boosts your sales and enhances the customer experience. Visualize a blog that attracts readers and keeps them engaged. 😍💼📈",
    "p5": "I'm here to make all of this possible. My motivation is to bring innovative and creative solutions to your project, whether it's on the Front-end or Back-end. With me, you'll have a dedicated partner who goes above and beyond expectations and delivers exceptional results. 🤝🔧🚀",
    "p6": "So, if you're ready to turn your vision into online success, contact me now. Let's work together to create an online presence that not only impresses but also drives your business goals. Your success is my commitment! 🌟🌐"
  },
  "servicos": {
    "site": {
      "title": "Website Development",
      "item1": {
        "title": "Custom Development",
        "descricao": "I specialize in creating websites that are truly unique for each client. I don't adopt 'one-size-fits-all' approaches or pre-made templates. Instead, I work closely with you to understand your goals, brand vision, and specific requirements. The result is a website that not only meets but exceeds your expectations."
      },
      "item2": {
        "title": "Responsive Design",
        "descricao": "I always prioritize accessibility in today's digital landscape. Therefore, all the websites I develop are designed with responsiveness in mind. This means your site will automatically adapt to any screen size, whether it's a desktop computer, tablet, or smartphone. I ensure your visitors have a seamless experience regardless of the device they're using."
      },
      "item3": {
        "title": "Advanced Features",
        "descricao": "It's not just about a basic online presence. I offer the integration of advanced features that can turn your website into a powerful business tool. Whether you need a robust e-commerce system, an interactive blog, or any other specific feature, I can make it a reality. As an experienced developer, I'm ready to tackle any challenge."
      }
    },
    "aplicacao": {
      "title": "Web Application Development",
      "item1": {
        "title": "Custom Solutions",
        "descricao": "Web applications are essential for many businesses today. I understand that your needs can be unique, which is why I offer tailor-made solutions. Whether you require a content management platform, an online reservation system, a corporate intranet, or any other type of application, I can create the perfect solution for you."
      },
      "item2": {
        "title": "Cutting-Edge Technology",
        "descricao": "I'm always committed to providing the latest in technology. This means your applications will be built with the most modern tools and frameworks available. This not only ensures exceptional performance but also solid security. I stay updated with technological trends to offer you the best."
      },
      "item3": {
        "title": "Complete Customization",
        "descricao": "Your web application should reflect your company's unique identity and goals. I not only build functional applications but also customize them to meet your specific needs. From user interface design to features and functionality, you'll have full control over how your application is shaped."
      }
    }
  },
  "skills": {
    "Front": {
      "html": "HTML is the markup language used to structure the content of a web page, while CSS is responsible for styling and giving the page its appearance, allowing the creation of attractive and responsive layouts.",
      "react": "React is a widely adopted JavaScript library for building interactive and responsive user interfaces. With the ability to create reusable components and efficiently manage the application's state, React is a powerful choice for modern front-end development.",
      "angular": "Angular is a popular front-end development framework maintained by Google that offers a robust framework for creating dynamic and scalable web applications. Based on TypeScript, it simplifies code organization, state management, routing, and user interface interactions, providing an efficient and highly modular development environment for building modern and responsive web applications."
    },
    "Back": {
      "node": "Node.js is a back-end development platform that enables the execution of JavaScript code outside the browser. With Node, you can create scalable and high-performance web applications, as well as RESTful APIs and command-line applications.",
      "postgresql": "PostgreSQL is an open-source, highly reliable, and scalable relational database management system that offers advanced features for efficient and secure data storage, querying, and manipulation.",
      "Nest": "Nest.js is a Node.js application development framework that focuses on creating scalable and efficient RESTful APIs and web applications. It uses TypeScript as its primary language and offers a modular, module-based architecture inspired by Angular. Nest.js promotes code organization through concepts such as dependency injection, controllers, modules, and middlewares. Additionally, it integrates well with other popular libraries like Express.js and provides robust tools for handling tasks such as authentication, data validation, and other common tasks in API development.",
      "Prisma": "Prisma ORM (Object-Relational Mapping) is an object-to-database mapping tool that simplifies and streamlines data access and manipulation in web applications. It supports various databases such as PostgreSQL, MySQL, and SQLite and allows developers to interact with the database using programming languages like TypeScript and JavaScript instead of writing SQL queries manually. Prisma ORM generates a data model based on the database schema and offers powerful features such as typed queries, automatic migrations, and an intuitive API for efficiently performing CRUD (Create, Read, Update, Delete) operations. This tool is widely adopted to simplify the development of applications that rely on relational databases."
    }
  },
  "Projetos": {
    "CuboFlix": {
      "title": "CuboFlix",
      "descricao1": "Project developed during the software development course at Cubos Academy.",
      "descricao2": "The challenge was to create a website called CuboFlix, inspired by popular streaming platforms.",
      "descricao3": "The application consumes data from an API to display information about movies and allows various interactions.",
      "descricao4": "Main features:",
      "descricao5": "1. Display of a list of movies available in the API;",
      "descricao6": "2. Movie search by name to quickly find titles;",
      "descricao7": "3. Highlight of the day, where a random movie is featured on the homepage;",
      "descricao8": "4. Movie details modal with additional information about the selected title;",
      "descricao9": "5. Light and dark mode with persistence after page refresh.",
      "tecnologias": "Technologies Used"
    },
    "AplicacaoCobrancas": {
      "title": "Billing Application",
      "descricao1": "Application developed to facilitate billing and customer management.",
      "descricao2": "Created for small businesses and freelancers who need to organize their collections and maintain financial control.",
      "descricao3": "The platform allows registering clients, managing bills, and tracking the status of each payment.",
      "descricao4": "Main features:",
      "descricao5": "1. User registration and login for secure access;",
      "descricao6": "2. Customer registration and listing, with contact details and billing history;",
      "descricao7": "3. Creation and management of invoices, including due dates and amounts;",
      "descricao8": "4. Editing and deleting invoices as needed;",
      "descricao9": "5. Detailed view of payments and the status of each invoice.",
      "tecnologias": "Technologies Used"
    },
    "PokeDex": {
      "title": "PokeDex",
      "descricao1": "Project developed to explore web development concepts with Angular.",
      "descricao2": "Inspired by the famous Pokédex, this application allows searching and viewing information about different Pokémon.",
      "descricao3": "The application consumes the public PokeAPI to provide detailed data about Pokémon.",
      "descricao4": "Main features:",
      "descricao5": "1. Complete listing of Pokémon available in the API;",
      "descricao6": "2. Quick search by name to find specific Pokémon;",
      "descricao7": "3. Detailed view with image, abilities, and stats;",
      "descricao8": "4. Responsive and stylish interface using Tailwind CSS.",
      "tecnologias": "Technologies Used"
    },
    "ClinicaBiointegralSaude": {
      "title": "Biointegral Saúde Clinic",
      "descricao1": "Project for creating the official website of the Biointegral Saúde Clinic.",
      "descricao2": "Developed to present the clinic, its services, and professionals to the public in an accessible and intuitive way.",
      "descricao3": "The website was created using the Next.js framework for better performance and SEO.",
      "descricao4": "Main features:",
      "descricao5": "1. Detailed display of the services offered by the clinic;",
      "descricao6": "2. Presentation of the professional team and their specialties;",
      "descricao7": "3. Contact form for scheduling and inquiries.",
      "tecnologias": "Technologies Used"
    }
  },
  "contato": {
    "celular": "Mobile Phone + WhatsApp"
  }
}
