{
  "idioma": "Idioma",
  "expandir": "Clique para ver as informações",
  "nav": {
    "Quem Sou": "Quem Sou",
    "Serviços": "Serviços",
    "Portifolio": "Portifolio",
    "Tecnologias": "Tecnologias",
    "Contato": "Contato"
  },
  "sobre": {
    "p1": "Você tem uma visão incrível para o seu site, blog, loja virtual ou projeto online, mas precisa de alguém que faça isso acontecer? Se a resposta for sim, estou aqui para tornar seus sonhos digitais uma realidade palpável. 😊",
    "p2": "Sou um Desenvolvedor Web Full Stack apaixonado por desafios e pela criação de experiências online extraordinárias. Minhas habilidades incluem domínio de tecnologias como ReactJS, Typescript, NodeJS, HTML, CSS e Javascript. Eu não apenas entendo essas linguagens, mas as coloco em ação de forma brilhante para criar sites e aplicativos que se destacam. 💻✨",
    "p3": "Mas isso não é tudo. Além da minha competência técnica, sou fluente em inglês e francês, o que significa que posso trabalhar em projetos multilíngues e alcançar audiências globais. 🌍🗣️",
    "p4": "Imagine ter um site que não apenas impressiona visualmente, mas também funciona de maneira impecável em todos os dispositivos. Pense em uma loja virtual que aumenta suas vendas e aprimora a experiência do cliente. Visualize um blog que atrai leitores e mantém a atenção deles. 😍💼📈",
    "p5": "Estou aqui para tornar tudo isso possível. Minha motivação é trazer soluções inovadoras e criativas para o seu projeto, independentemente de ser no Front-end ou Back-end. Comigo, você terá um parceiro dedicado que vai além das expectativas e entrega resultados excepcionais. 🤝🔧🚀",
    "p6": "Então, se você está pronto para transformar sua visão em sucesso online, entre em contato comigo agora. Vamos trabalhar juntos para criar uma presença online que não apenas impressionará, mas também impulsionará seus objetivos de negócios. Seu sucesso é o meu compromisso! 🌟🌐"
  },
  "servicos": {
    "site": {
      "title": "Desenvolvimento de Sites",
      "item1": {
        "title": "Desenvolvimento Sob Medida",
        "descricao": "Me dedico a criar sites que são verdadeiramente únicos para cada cliente. Não adoto abordagens 'tamanho único' ou modelos pré-fabricados. Em vez disso, trabalho em estreita colaboração com você para entender suas metas, visão de marca e requisitos específicos. O resultado é um site que não apenas atende, mas excede suas expectativas."
      },
      "item2": {
        "title": "Design Responsivo",
        "descricao": "Sempre penso que a acessibilidade é fundamental nos dias de hoje. Portanto, todos os sites que desenvolvo são projetados com responsividade em mente. Isso significa que seu site se ajustará automaticamente a qualquer tamanho de tela, seja um computador desktop, tablet ou smartphone. Garanto que seus visitantes tenham uma experiência perfeita, independentemente do dispositivo que estejam usando."
      },
      "item3": {
        "title": "Recursos Avançados",
        "descricao": "Não se trata apenas de uma presença online básica. Ofereço a integração de recursos avançados que podem transformar seu site em uma poderosa ferramenta de negócios. Se você deseja um sistema de comércio eletrônico robusto, um blog interativo ou qualquer outro recurso específico, posso tornar isso realidade. Como desenvolvedor experiente estou prontos para enfrentar qualquer desafio."
      }
    },
    "aplicacao": {
      "title": "Desenvolvimento de Aplicações Web",
      "item1": {
        "title": "Soluções Sob Medida",
        "descricao": "As aplicações web são essenciais para muitas empresas hoje em dia. Entendo que suas necessidades podem ser únicas, e é por isso que ofereço soluções sob medida. Independentemente de você precisar de uma plataforma de gerenciamento de conteúdo, um sistema de reservas online, uma intranet corporativa ou qualquer outro tipo de aplicação, posso criar a solução perfeita para você."
      },
      "item2": {
        "title": "Tecnologia de Ponta",
        "descricao": "Estou sempre comprometido em fornecer o que há de mais recente em termos de tecnologia. Isso significa que suas aplicações serão construídas com as ferramentas e estruturas mais modernas disponíveis.Isso não apenas garante desempenho excepcional, mas também segurança sólida. Mantenho-me sempre atualizado com as tendências tecnológicas para oferecer o melhor a você."
      },
      "item3": {
        "title": "Personalização Completa",
        "descricao": "Sua aplicação web deve refletir a identidade e os objetivos exclusivos de sua empresa. Não apenas construo aplicações funcionais, mas também as personalizam para atender às suas necessidades específicas. Desde o design da interface do usuário até os recursos e a funcionalidade, você terá controle total sobre como sua aplicação é moldada."
      }
    }
  },
  "skills": {
    "Front": {
      "html": "HTML é a linguagem de marcação usada para estruturar o conteúdo de uma página web, enquanto o CSS é responsável por estilizar e dar aparência à página, permitindo a criação de layouts atraentes e responsivos.",
      "react": "React é uma biblioteca JavaScript amplamente adotada para criar interfaces de usuário interativas e reativas. Com a capacidade de criar componentes reutilizáveis e gerenciar eficientemente o estado da aplicação, o React é uma escolha poderosa para o desenvolvimento front-end moderno.",
      "angular": "Angular é um popular framework de desenvolvimento front-end mantido pelo Google que oferece uma estrutura robusta para a criação de aplicativos web dinâmicos e escaláveis. Baseado em TypeScript, ele facilita a organização do código, gerenciamento de estados, roteamento, e interações com a interface do usuário, proporcionando um ambiente de desenvolvimento eficiente e altamente modular para construir aplicações web modernas e responsivas.",
      "tailwind": "Tailwind CSS é um framework de design CSS inovador que adota uma abordagem utility-first, fornecendo uma extensa lista de classes pré-definidas para aplicar diretamente a elementos HTML, simplificando o processo de estilização. Isso permite uma criação de interfaces de usuário altamente eficiente e personalizável, com configurações flexíveis e suporte para responsividade, enquanto mantém um desempenho otimizado. Com uma comunidade ativa e plugins adicionais, o Tailwind CSS oferece um ecossistema completo para desenvolver interfaces web modernas de maneira rápida e adaptável, tornando-o uma escolha popular para desenvolvedores em busca de um fluxo de trabalho de design ágil e eficaz."
    },
    "Back": {
      "node": "Node.js é uma plataforma de desenvolvimento back-end que permite a execução de código JavaScript fora do navegador. Com o Node, é possível criar aplicações web escaláveis e de alta performance, além de APIs RESTful e aplicações de linha de comando.",
      "postgresql": "PostgreSQL é um sistema de gerenciamento de banco de dados relacional de código aberto, altamente confiável e escalável, que oferece recursos avançados para armazenamento, consulta e manipulação de dados de forma eficiente e segura.",
      "Nest": "Nest.js é um framework de desenvolvimento de aplicativos em Node.js que se concentra na criação de APIs RESTful e aplicações web escaláveis e eficientes. Ele utiliza o TypeScript como linguagem principal e oferece uma arquitetura modular e baseada em módulos, inspirada no Angular. O Nest.js promove a organização do código por meio de conceitos como injeção de dependência, controladores, módulos e middlewares. Além disso, ele se integra bem com outras bibliotecas populares, como o Express.js, e fornece ferramentas robustas para lidar com autenticação, validação de dados e outras tarefas comuns no desenvolvimento de APIs.",
      "Prisma": "O Prisma ORM (Object-Relational Mapping) é uma ferramenta de mapeamento de objetos para bancos de dados que simplifica e agiliza o acesso e a manipulação de dados em aplicativos web. Ele oferece suporte a várias bases de dados, como PostgreSQL, MySQL e SQLite, e permite que os desenvolvedores interajam com o banco de dados usando linguagens de programação, como TypeScript e JavaScript, em vez de escrever consultas SQL manualmente. O Prisma ORM gera um modelo de dados com base no esquema do banco de dados e oferece recursos poderosos, como consultas tipadas, migrações automáticas e uma API intuitiva para realizar operações de CRUD (Criar, Ler, Atualizar, Excluir) de maneira eficiente. Essa ferramenta é amplamente adotada para simplificar o desenvolvimento de aplicativos que dependem de bancos de dados relacionais."
    }
  },
  "Projetos": {
    "CuboFlix": {
      "title": "CuboFlix",
      "descricao1": "Projeto desenvolvido durante o curso de desenvolvimento de software da Cubos Academy.",
      "descricao2": "O desafio era criar um site chamado CuboFlix, inspirado em plataformas de streaming populares.",
      "descricao3": "A aplicação consome dados de uma API para exibir informações sobre filmes e permite diversas interações.",
      "descricao4": "Principais funcionalidades:",
      "descricao5": "1. Exibição de uma lista de filmes disponíveis na API;",
      "descricao6": "2. Pesquisa de filmes por nome para encontrar títulos rapidamente;",
      "descricao7": "3. Destaque do dia, onde um filme aleatório ganha destaque na página inicial;",
      "descricao8": "4. Modal de detalhes do filme, com informações adicionais sobre o título selecionado;",
      "descricao9": "5. Modo claro e escuro com persistência após atualização da página.",
      "tecnologias": "Tecnologias Utilizadas"
    },
    "AplicacaoCobrancas": {
      "title": "Aplicação de Cobrança",
      "descricao1": "Aplicação desenvolvida para facilitar a gestão de cobranças e clientes.",
      "descricao2": "Criada para pequenas empresas e autônomos que precisam organizar seus recebimentos e manter o controle financeiro.",
      "descricao3": "A plataforma permite cadastrar clientes, gerenciar cobranças e acompanhar o status de cada pagamento.",
      "descricao4": "Principais funcionalidades:",
      "descricao5": "1. Cadastro e login de usuários para acesso seguro;",
      "descricao6": "2. Registro e listagem de clientes, com detalhes de contato e histórico de cobranças;",
      "descricao7": "3. Geração e gerenciamento de cobranças, incluindo prazos e valores;",
      "descricao8": "4. Edição e exclusão de cobranças conforme necessidade;",
      "descricao9": "5. Visualização detalhada de pagamentos e status de cada cobrança.",
      "tecnologias": "Tecnologias Utilizadas"
    },
    "PokeDex": {
      "title": "PokeDex",
      "descricao1": "Projeto desenvolvido para explorar conceitos de desenvolvimento web com Angular.",
      "descricao2": "Inspirado na famosa Pokédex, essa aplicação permite buscar e visualizar informações sobre diferentes Pokémon.",
      "descricao3": "A aplicação consome a API pública PokeAPI para fornecer dados detalhados sobre os Pokémon.",
      "descricao4": "Principais funcionalidades:",
      "descricao5": "1. Listagem completa de Pokémon disponíveis na API;",
      "descricao6": "2. Pesquisa rápida por nome para encontrar Pokémon específicos;",
      "descricao7": "3. Visualização detalhada com imagem, habilidades e estatísticas;",
      "descricao8": "4. Interface responsiva e estilizada com Tailwind CSS.",
      "tecnologias": "Tecnologias Utilizadas"
    },
    "ClinicaBiointegralSaude": {
      "title": "Clínica Biointegral Saúde",
      "descricao1": "Projeto de criação do site oficial da Clínica Biointegral Saúde.",
      "descricao2": "Desenvolvido para apresentar a clínica, seus serviços e profissionais ao público de maneira acessível e intuitiva.",
      "descricao3": "O site foi criado utilizando a framework Next.js para melhor performance e SEO.",
      "descricao4": "Principais funcionalidades:",
      "descricao5": "1. Exibição detalhada dos serviços oferecidos pela clínica;",
      "descricao6": "2. Apresentação da equipe de profissionais e suas especialidades;",
      "descricao7": "3. Formulário de contato para agendamento e dúvidas.",
      "tecnologias": "Tecnologias Utilizadas"
    }
  },
  "contato": {
    "celular": "Celular + whatsapp"
  }
}
